app/controllers/movies_controller.rb

  def index
	@all_ratings = Movie.ratings
	@order = params[:order]
    @filtered_ratings = Array.new
    @ratings_hash = Hash.new

    if (params[:order]) != nil
      session[:order] = params[:order]
    end

    if (params[:ratings])
       params[:ratings].each_key { |r| @filtered_ratings.push(r); @ratings_hash[r] = r; }
		if @order == "title"
			@movies = Movie.find(:all, :conditions => {:rating => @filtered_ratings}, :order => "title")
		elsif @order == "release_date"
			@movies = Movie.find(:all, :conditions => {:rating => @filtered_ratings},  :order => "release_date")
		else
			@movies = @filtered_ratings.nil? ? Movie.all : Movie.find(:all, :conditions => {:rating => @filtered_ratings}, :order => @order)
		end
       session[:ratings] = @ratings_hash
    elsif (session[:ratings])
		flash.keep
        #redirect_to movies_path(:order=>session[:order], :ratings=>session[:ratings])
		#@movies = @filtered_ratings.nil? ? Movie.all : Movie.find(:all, :conditions => {:rating => @filtered_ratings}, :order => @order)
		@movies = Movie.all
---
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG', 'PG-13') AND "movies"."order" IS NULL
SELECT "movies".* FROM "movies" ORDER BY release_date